Revit 2027 API
ParameterTypeId.LevelDataSurfaceArea Property
 "Exterior Surface Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LevelDataSurfaceArea { get; }
Public Shared ReadOnly Property LevelDataSurfaceArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LevelDataSurfaceArea {
	ForgeTypeId^ get ();
}
static member LevelDataSurfaceArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace